package com.example.rces.utils;

import io.restassured.RestAssured;
import io.restassured.specification.RequestSpecification;

public class OneCHelper {

    public static RequestSpecification getOneCSpec() {
        return RestAssured.given()
                .baseUri("http://192.168.0.2")
                .basePath("/B5/hs/ObmenDoc/LoadData/")
                .header("Authorization", "Basic 0J/QsNCy0LvQuNGH0LXQvdC60L7QlNCQOjA=")
                .contentType("application/json; charset=UTF-8")
                .accept("*/*");
    }

    public static String buildCustomerOrderQuery(String customerOrder) {
        return "ВЫБРАТЬ " +
                "ЕСТЬNULL(втсп.Номенклатура.Наименование, \"\") КАК НаименованиеПодзаказа, " +
                "ЕСТЬNULL(БМ_КартаЗамены.ОбозначениеЧертежа.Наименование, \"\") КАК Чертеж, " +
                "ЕСТЬNULL(БМ_КартаЗамены.НаименованиеДетали.Наименование, \"\") КАК Деталь, " +
                "ЕСТЬNULL(БМ_КартаЗамены.ОбщееКоличествоДеталей, 0) КАК КоличествоДеталей, " +
                "ЕСТЬNULL(БМ_КартаЗамены.РазмерЗаготовки.Наименование, \"\") КАК Размер, " +
                "ЕСТЬNULL(БМ_КартаЗамены.Номенклатура.Наименование, \"\") КАК Сталь, " +
                "ЕСТЬNULL(БМ_КартаЗамены.Количество, 0) КАК КоличествоСтали " +
                "ИЗ Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК втсп " +
                "ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.БМ_КартаЗамены КАК БМ_КартаЗамены " +
                "ПО втсп.Ссылка = БМ_КартаЗамены.Спецификация " +
                "ГДЕ втсп.Номенклатура В " +
                "(ВЫБРАТЬ ЗаказПокупателяТовары.Номенклатура " +
                "ИЗ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары " +
                "ГДЕ ЗаказПокупателяТовары.Номенклатура.Наименование ПОДОБНО \"%" + customerOrder + "%\" " +
                "ОБЪЕДИНИТЬ " +
                "ВЫБРАТЬ ЗаказНаПроизводствоПродукция.Номенклатура " +
                "ИЗ Документ.ЗаказНаПроизводство.Продукция КАК ЗаказНаПроизводствоПродукция " +
                "ГДЕ ЗаказНаПроизводствоПродукция.Номенклатура.Наименование ПОДОБНО \"%" + customerOrder + "%\") " +
                "И втсп.Ссылка.Наименование ПОДОБНО \"%СМС%\" " +
                "И НЕ втсп.Ссылка.Комментарий ПОДОБНО \"%Аннулировано%\"";
    }

    public static String buildJsonBody(String query) {
        String escapedQuery = query
                .replace("\\", "\\\\")
                .replace("\"", "\\\"")
                .replace("\n", " ")
                .replace("\r", "");

        return "{"
                + "\"ГуидОбработки\":\"78fe8cfd-9386-11ef-84e3-e41f13c16406\","
                + "\"ИмяПроцедуры\":\"МассивСтруктурПоЗапросу\","
                + "\"ИмяНачальнойПроцедуры\":\"Проверка\","
                + "\"ТекстЗапроса\":\"" + escapedQuery + "\""
                + "}";
    }

}
